CSI API ETABS v1
cAnalyze.ModifyUndeformedGeometryModeShape Method
 Modifies the undeformed geometry based on the shape of a specified mode
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ModifyUndeformedGeometryModeShape(
	string CaseName,
	int Mode,
	double MaxDispl,
	int Direction,
	bool Original = false
)
Function ModifyUndeformedGeometryModeShape (
	CaseName As String,
	Mode As Integer,
	MaxDispl As Double,
	Direction As Integer,
	Optional Original As Boolean = false
) As Integer
Dim instance As cAnalyze
Dim CaseName As String
Dim Mode As Integer
Dim MaxDispl As Double
Dim Direction As Integer
Dim Original As Boolean
Dim returnValue As Integer
returnValue = instance.ModifyUndeformedGeometryModeShape(CaseName,
	Mode, MaxDispl, Direction, Original)
int ModifyUndeformedGeometryModeShape(
	String^ CaseName,
	int Mode,
	double MaxDispl,
	int Direction,
	bool Original = false
)
abstract ModifyUndeformedGeometryModeShape :
        CaseName : string *
        Mode : int *
        MaxDispl : float *
        Direction : int *
        ?Original : bool
(* Defaults:
        let _Original = defaultArg Original false
*)
-> int
Parameters
CaseName
Type: System.String
 The name of a load case
Mode
Type: System.Int32
 The mode shape
MaxDispl
Type: System.Double
 The maximum displacement to which the mode shape will be scaled
Direction
Type: System.Int32
 The direction in which to apply the geometry modification
X
Y
Z
Resultant
Original (Optional)
Type: System.Boolean
 If this item is True, all other input items in this function are ignored and the original undeformed geometry data is reinstated.
Return Value
Type: Int32
 Returns zero if it is successful; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'assign point object restraints
       ReDim Value(5)
       For i = 0 To 5
           Value(i) = True
       Next i
       ret = SapModel.PointObj.SetRestraint("1", Value)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis
   'modify undeformed geometry
       ret = SapModel.Analyze.ModifyUndeformedGeometryModeShape("Modal", 1, 1.0, 2)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace